tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "heroku/brew"
tap "mongodb/brew"

#--------------------------------------#

# Programming language
brew "deno"
brew "go"
brew "nvm"
brew "pyenv"

# Database
brew "mongodb/brew/mongodb-community"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "redis", restart_service: true

brew "awscli"
brew "gh"
brew "heroku/brew/heroku"
brew "minikube"
brew "neovim"
brew "nginx"
brew "now-cli"
brew "skaffold"

#--------------------------------------#

cask "adoptopenjdk"
cask "alfred"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "bitwarden"
cask "chromium"
cask "dbeaver-community"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "google-backup-and-sync"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hyper"
cask "insomnia"
cask "microsoft-office"
cask "notion"
cask "responsively"
cask "slack"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "zeplin"

#--------------------------------------#

mas "com.apple.dt.Xcode", id: 497799835